In [1]:
import pandas as pd
india_weather = pd.DataFrame({                         ## Hash map or python dictionary
    "city":["mumbai","delhi","banglore"],
    "temparature":[32,45,30],
    "humidity":
    [80,60,78]
})
india_weather

       city  temparature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando","NJ"],
    "temparature":[21,41,35,33],
    "humidity":[68,65,75,35]
})
us_weather

       city  temparature  humidity
0  new york           21        68
1   chicago           41        65
2   orlando           35        75
3        NJ           33        35

In [3]:
df=pd.concat([india_weather,us_weather]) ## Like a union all, even indices dont change 
df

       city  temparature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           41        65
2   orlando           35        75
3        NJ           33        35

In [4]:
df=pd.concat([india_weather,us_weather], axis=1) ## Joining data based on indices, default is axis =0(equivalent to union)
df

       city  temparature  humidity      city  temparature  humidity
0    mumbai         32.0      80.0  new york           21        68
1     delhi         45.0      60.0   chicago           41        65
2  banglore         30.0      78.0   orlando           35        75
3       NaN          NaN       NaN        NJ           33        35

In [5]:
df=pd.concat([india_weather,us_weather],ignore_index=True) ## Like a union all,   indices will change 
df

       city  temparature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           41        65
5   orlando           35        75
6        NJ           33        35

In [8]:
## Merge Data Frames
temparature_df=pd.DataFrame({
     "city":["mumbai","delhi","banglore","Hyderabad"],
    "temparature":[32,45,30,40],
    })

temparature_df

        city  temparature
0     mumbai           32
1      delhi           45
2   banglore           30
3  Hyderabad           40

In [7]:
humidity_df=pd.DataFrame({
     "city":["mumbai","delhi","banglore" ],
    "humidity":[68,65,40],
    })
humidity_df

       city  humidity
0    mumbai        68
1     delhi        65
2  banglore        40

In [9]:
df=pd.merge(temparature_df,humidity_df,on='city') ## inner Join based on city
df

       city  temparature  humidity
0    mumbai           32        68
1     delhi           45        65
2  banglore           30        40

In [10]:
df=pd.merge(temparature_df,humidity_df,on= 'city',how='outer') ## Outer Join based on city
df

        city  temparature  humidity
0     mumbai           32      68.0
1      delhi           45      65.0
2   banglore           30      40.0
3  Hyderabad           40       NaN

In [11]:
import pandas as pd
df=pd.DataFrame([1,2,3,4,5,8,9,10,18,19], index=[48,49,40,41,42,43,9,10,18,19]) ## Custome index
df

     0
48   1
49   2
40   3
41   4
42   5
43   8
9    9
10  10
18  18
19  19

In [12]:
df.loc[43] ## loc is user defined index

0    8
Name: 43, dtype: int64

In [13]:
df.loc[:43]

    0
48  1
49  2
40  3
41  4
42  5
43  8

In [14]:
df.iloc[3] ## iloc is default index or row number

0    4
Name: 41, dtype: int64

In [19]:
df.iloc[:3]

    0
48  1
49  2
40  3

In [16]:
df.iloc[3]

0    4
Name: 41, dtype: int64